Revit 2027 API
FabricationPartBrowserChangedEventArgs Properties
The FabricationPartBrowserChangedEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
NumberOfSolutions |  The number of active solutions in routing solution mode.
Operation |  The operation associated with this event
ServiceId |  The identifier for the fabrication service.
Top
See Also
Reference
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace